{"title":"Witaj!","text":[{"content":"Zanim zaczniemy muszę Ci wytłumaczyć jak to będzie działać. Ten fragment strony, na którym znajduję się ten tekst, to fragment z instrukcjami oraz wyjaśnieniami. Natomiast po prawo znajduje się edytor. Zauważyłes już pewnie że w naszym edytorze jest jakiś fragment kodu. Jest to oczywiście składnia języka HTML, którego będziemy się uczyć. Ten fragment to szkielet każdej strony internetowej. Jest to swego rodzaju baza od której powinieneś zaczynać pracę nad każdym swoim projektem."},{"content":"Po krótce omówie Ci za co odpowiada każdy ze znaczników."},{"content":"Zacznijmy od:","code":[{"content":"<!DOCTYPE html>"}]},{"content":"Dzięki tzw. doctype'owi, przeglądarka wie że ma do czynienia z dokumentem HTML i dzięki temu może go poprawnie zinterpretować."},{"content":"Dalej mamy znacznik:","code":[{"content":"<html>"}]},{"content":"Jak się domyślasz oznacza to nic innego jak tylko to, że zawiera się w nim cały kod HTML. Prawda że logiczne :)"},{"content":"W linii 3 mamy znacznik:","code":[{"content":"<head>"}]},{"content":"Jest to znacznik w którym możemy zapisać tytuł strony, możemy podać autora, ale to co zapiszemy w \"głowie\"  nie pojawią sie \"na stronie\". W tym znaczniku powinniśmy mieć to co mamy w linii 4 i 5","code":[{"content":"<meta charset=\"UTF-8\">"},{"content":"<title>Tytuł</title>"}]},{"content":"Znacznik meta w tym przypadku (ponieważ ma atrybut charset), określa system kodowania. Mówiąć prosto wybieramy system kodowania utf-8 który zawiera polskie znaki. Znacznik title jak się już napewno domyśliłeś zawiera tytuł strony. Możesz go zobaczyć na karcie przeglądarki."},{"content":"Przyglądając się temu znacznikowi zauważyłeś pewnie nową rzecz. W języku html prawie każdy znacznik zawierający jakąś treść powinien zostać zamknięty, aby przeglądarka wiedziała, że musi zmienić format wyświetlania. Zamknięcie dokonuje się przez dodanie po znaku <, znaku /. Tak jak w tym przypadku:","code":[{"content":"</title>"}]},{"content":"Analogicznie należy postąpić ze znacznikiem z lini 3. ","code":[{"content":"</head>"}]},{"content":"Dalej pozostaje nam już tylko znacznik:","code":[{"content":"<body>"}]},{"content":"Czyli tzw ciało dokumentu. Pomiędzy znacznikiem otwierającym <body> a zamykającym </body> umieszcza się pozostałe elementy strony, czyli te odpowiadające za konkretną jej treść, wszystko co ma na niej \"być\""},{"content":"Oczywiście należy pamiętać o zamknięciu tych znaczników","code":[{"content":"</body>"},{"content":"</html>"}]},{"content":"Tak jak zrobiono to w linii 8 i 9"},{"content":"Jeśli już się zaznajomiłeś z podstawowym szkieletem HTML'a, kliknik przycisk \"sprawdź\" by kontynuować."}],"progress":"5%","next":"#!/exercise/2","test":{"html":["<!doctype html>","<html>","<head>","<meta charset=\"utf-8\">","<title>","<title>","</head>","<body>","</body>","</html>"]}}