{"title":"Wygląd rzecz ważna","text":[{"content":"Jak możesz zauważyć nasza strona na razie nie jest zbyt atrakcyjna. Pora to zmienić!"},{"content":"W tym celu wykorzystamy język kaskadowych arkuszy stylów. Dzięki kliku regułom dodamy naszej stronie kolorytu :)"},{"content":"Zacznijmy od przełaczenia się na plik na którym będziemy pracować. Na zakładce w edytorze kliknij na style.css"},{"content":"Pierwsza regułą jaką dodamy będzie \"wyzerowanie\" domyślnych stylów przeglądarki, ponieważ każda z nich ma ustalony inny domyślny wygląd niektórych elementów budujących stronę. Bez tego mogłoby się okazać, że strona wygląda inaczej w przegladarce firmy X a jeszcze inaczej w przegladarce firmy Z. W tym celu dodajmy regułę","code":[{"content":"* {"},{"content":"  padding: 0;"},{"content":"  margin: 0;"},{"content":"}"}]},{"content":"Aby móc wykorzystać całą dostępną nam przestrzeń musimy zwiększyć domyślny rozmiar elementów nadzrzędnych naszych sekcji, czyli dla html i body musimy utworzyć taką regułę","code":[{"content":"html,"},{"content":"body {"},{"content":"  height: 100%"},{"content":"}"}]},{"content":"Dla większej czytelności zmieńmy domyślną czcionkę na coś bardziej przyziemnego. W tym celu przejdz spowrotem do pliku index.html i w nowej lini po znaczniku zamykającym title wklej to","code":[{"content":"<link href='https://fonts.googleapis.com/css?family=Open+Sans:400,300italic,400italic,600,600italic,300' rel='stylesheet' type='text/css'>"}]},{"content":"Jak już pewnie zauważyłeś skorzystaliśmy z serwisu Google Fonts który na swoich serwerach przechowuje czcionki do wykorzystania na stronie internetowej"},{"content":"Aby zaimplementować nasz font, musismy spowrotem przejść do pliku style.css"},{"content":"Tam dodajemy kolejną regułę dla body","code":[{"content":"body {"},{"content":"  font-family: 'Open Sans', sans-serif"},{"content":"}"}]},{"content":"font-family określa nam rodzinę czcionki jaką używamy, w naszym przypadku jest to dolączony przez nas Open Sans, sans-serif natomiast oznacza alternatywny font, np. w przypadku gdy serwer na którym jest umieszczony nasz niestandardowy font, nie odpowiada"}],"progress":"10%","next":"#!/exercise/6","test":{"html":["<!doctype html>","<html>","<head>","<meta charset=\"utf-8\">","<title>","<title>","</head>","<body>","<section>","<h1>","</h1>","</section>","</body>","<div>","<h2>","</h2>","<p>","</p>","<img src","</div>","</html>"],"css":["*","body","html"]}}