{"title":"Ostylujmy sekcję","text":[{"content":"Dodaliśmy niestandarową czcionkę, ale to jeszcze nie koniec zmian w wyglądzie naszej strony"},{"content":"Zabierzmy sie teraz za sekcję. Musimy jednak zacząć do powrotu do pliku index.html"},{"content":"Aby móc w łatwy sposób wyszukiwać elementy w CSS, musimy dla elementów których wygląd chcemy zmienić przypisać odpowiednie klasy"},{"content":"Aby to zrobić odszukajmy pierwsza sekcję i dodajmy do niej atrybut class=\"startowa\". Powinno to wyglądać tak:","code":[{"content":"<section class=\"startowa\">"}]},{"content":"Dla drugiej sekcji nadajmy analogicznie klasę \"informacje\"","code":[{"content":"<section class=\"informacje\">"}]},{"content":"Dla znaczników zamykających nie dodajemy klas. Teraz możemy przejść do zakładki style.css i przystąpić do ostylowania tych sekcji (kropka przed nazwą oznacza że wyszukujemy klasę)","code":[{"content":".startowa {"},{"content":"  width: 100%;"},{"content":"  height: 100%;"},{"content":"  background-color: #16a085;"},{"content":"}"}]},{"content":"Wlaściwości width i height ustawione na 100% maja za zadanie wykorzystać całą przestrzeń ekranu, natomiast border-color pozwala ustawić kolor tła - kolor może być zapisany np. heksadecymalnie: #FFFFFF, lub zgodnie z przestrzenią kolorów rgb: rgb(255, 255, 255)"},{"content":"\"Upiększmy\" teraz naszą drugą sekcję, w tym celu analogicznie budujemy regułę dla klasy informacje","code":[{"content":".informacje {"},{"content":"  width: 100%;"},{"content":"  height: 100%;"},{"content":"  display: flex;"},{"content":"}"}]},{"content":"Pewnie zauważyłeś nową własciwość jaką jest display, odpowiada ona za sposób wyświetlania elementu. Np. inline - liniowy, block - blokowy lub jak w naszym przypadku flex. Co to takiego ?!, taki sposób wyświetlania pozwala na dostosowanie wyświetlania elmentu niezależnie od rozdzielczości. W naszym przypadku wykorzystujemy tę właściwość aby stworzyć 2 kolumny. Właśnie powoli rozwiązuje się zagadka dot. tajemniczego elementu blokowego \"opakowującego\" zdjęcie."}],"progress":"75%","next":"#!/exercise/7","test":{"html":["<!doctype html>","<html>","<head>","<meta charset=\"utf-8\">","<title>","<title>","</head>","<body>","<section class=\"startowa\">","<section class=\"informacje\">","<h1>","</h1>","</section>","</body>","<div>","<h2>","</h2>","<p>","</p>","<img src","</div>","</html>"],"css":["*","body",".startowa",".informacje"]}}